In [1]:
people={
    "First": ["corey","jane","John"],
    "Last":["Schefer","Fernandis","Mathai"],
    "Age":[67,87,90],
    "Email":["coreyshefer@gmail.com","Janefr@gmail.com","johnmathai@gmail.com"]
}

In [2]:
people

{'First': ['corey', 'jane', 'John'],
 'Last': ['Schefer', 'Fernandis', 'Mathai'],
 'Age': [67, 87, 90],
 'Email': ['coreyshefer@gmail.com',
  'Janefr@gmail.com',
  'johnmathai@gmail.com']}

In [3]:
import pandas as pd

In [4]:
df=pd.DataFrame(people)

In [5]:
df

   First       Last  Age                  Email
0  corey    Schefer   67  coreyshefer@gmail.com
1   jane  Fernandis   87       Janefr@gmail.com
2   John     Mathai   90   johnmathai@gmail.com

In [6]:
df["First"]+" "+df["Last"]

0     corey Schefer
1    jane Fernandis
2       John Mathai
dtype: object

In [7]:
df["First"]+" "+df["Email"]

0    corey coreyshefer@gmail.com
1          jane Janefr@gmail.com
2      John johnmathai@gmail.com
dtype: object

In [8]:
df["First"]+" "+df["Last"]

0     corey Schefer
1    jane Fernandis
2       John Mathai
dtype: object

In [9]:
df["Full_Name"]=df["First"]+" "+df["Last"]

In [10]:
df

   First       Last  Age                  Email       Full_Name
0  corey    Schefer   67  coreyshefer@gmail.com   corey Schefer
1   jane  Fernandis   87       Janefr@gmail.com  jane Fernandis
2   John     Mathai   90   johnmathai@gmail.com     John Mathai

In [11]:
df.drop(columns=["First","Last"])

   Age                  Email       Full_Name
0   67  coreyshefer@gmail.com   corey Schefer
1   87       Janefr@gmail.com  jane Fernandis
2   90   johnmathai@gmail.com     John Mathai

In [12]:
df["Full_Name"].str.split(" ",expand=True)

       0          1
0  corey    Schefer
1   jane  Fernandis
2   John     Mathai

In [13]:
df[["First","Last"]]=df["Full_Name"].str.split(" ",expand=True)

In [14]:
df.append({"First":"Tony","Last":"Bigrenja"},ignore_index=True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_1352\636096605.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({"First":"Tony","Last":"Bigrenja"},ignore_index=True)

   First       Last   Age                  Email       Full_Name
0  corey    Schefer  67.0  coreyshefer@gmail.com   corey Schefer
1   jane  Fernandis  87.0       Janefr@gmail.com  jane Fernandis
2   John     Mathai  90.0   johnmathai@gmail.com     John Mathai
3   Tony   Bigrenja   NaN                    NaN             NaN

In [15]:
people1={
    "First": ["Ram","janeet","Johny"],
    "Last":["Singh","Feerdaus","Mathaari"],
    "Age":[67,87,90],
    "Email":["ram@gmail.com","Janeeet@gmail.com","johnmathari@gmail.com"]
}

In [16]:
df2=pd.DataFrame(people1)

In [17]:
df2

    First      Last  Age                  Email
0     Ram     Singh   67          ram@gmail.com
1  janeet  Feerdaus   87      Janeeet@gmail.com
2   Johny  Mathaari   90  johnmathari@gmail.com

In [18]:
df.append(df2,ignore_index=True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_1352\2741153526.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2,ignore_index=True)

    First       Last  Age                  Email       Full_Name
0   corey    Schefer   67  coreyshefer@gmail.com   corey Schefer
1    jane  Fernandis   87       Janefr@gmail.com  jane Fernandis
2    John     Mathai   90   johnmathai@gmail.com     John Mathai
3     Ram      Singh   67          ram@gmail.com             NaN
4  janeet   Feerdaus   87      Janeeet@gmail.com             NaN
5   Johny   Mathaari   90  johnmathari@gmail.com             NaN

In [19]:
df.append(df2,ignore_index=True,sort=False)

C:\Users\Admin\AppData\Local\Temp\ipykernel_1352\1395412685.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2,ignore_index=True,sort=False)

    First       Last  Age                  Email       Full_Name
0   corey    Schefer   67  coreyshefer@gmail.com   corey Schefer
1    jane  Fernandis   87       Janefr@gmail.com  jane Fernandis
2    John     Mathai   90   johnmathai@gmail.com     John Mathai
3     Ram      Singh   67          ram@gmail.com             NaN
4  janeet   Feerdaus   87      Janeeet@gmail.com             NaN
5   Johny   Mathaari   90  johnmathari@gmail.com             NaN

In [20]:
df.append(df2,ignore_index=True,sort=False)

C:\Users\Admin\AppData\Local\Temp\ipykernel_1352\1395412685.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2,ignore_index=True,sort=False)

    First       Last  Age                  Email       Full_Name
0   corey    Schefer   67  coreyshefer@gmail.com   corey Schefer
1    jane  Fernandis   87       Janefr@gmail.com  jane Fernandis
2    John     Mathai   90   johnmathai@gmail.com     John Mathai
3     Ram      Singh   67          ram@gmail.com             NaN
4  janeet   Feerdaus   87      Janeeet@gmail.com             NaN
5   Johny   Mathaari   90  johnmathari@gmail.com             NaN

In [21]:
df

   First       Last  Age                  Email       Full_Name
0  corey    Schefer   67  coreyshefer@gmail.com   corey Schefer
1   jane  Fernandis   87       Janefr@gmail.com  jane Fernandis
2   John     Mathai   90   johnmathai@gmail.com     John Mathai

In [22]:
df.drop(index=2)

   First       Last  Age                  Email       Full_Name
0  corey    Schefer   67  coreyshefer@gmail.com   corey Schefer
1   jane  Fernandis   87       Janefr@gmail.com  jane Fernandis

In [23]:
df

   First       Last  Age                  Email       Full_Name
0  corey    Schefer   67  coreyshefer@gmail.com   corey Schefer
1   jane  Fernandis   87       Janefr@gmail.com  jane Fernandis
2   John     Mathai   90   johnmathai@gmail.com     John Mathai

In [24]:
df.drop(index=df[df["Last"]=="Schefer"].index)

  First       Last  Age                 Email       Full_Name
1  jane  Fernandis   87      Janefr@gmail.com  jane Fernandis
2  John     Mathai   90  johnmathai@gmail.com     John Mathai

In [25]:
df3=df.append(df2,ignore_index=True,sort=False)

C:\Users\Admin\AppData\Local\Temp\ipykernel_1352\1983395299.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3=df.append(df2,ignore_index=True,sort=False)

In [26]:
df3

    First       Last  Age                  Email       Full_Name
0   corey    Schefer   67  coreyshefer@gmail.com   corey Schefer
1    jane  Fernandis   87       Janefr@gmail.com  jane Fernandis
2    John     Mathai   90   johnmathai@gmail.com     John Mathai
3     Ram      Singh   67          ram@gmail.com             NaN
4  janeet   Feerdaus   87      Janeeet@gmail.com             NaN
5   Johny   Mathaari   90  johnmathari@gmail.com             NaN